app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "congrats!"], ["commenter", "Laura"], ["created_at", Sun, 27 Oct 2013 20:11:12 UTC +00:00], ["post_id", 4], ["updated_at", Sun, 27 Oct 2013 20:11:12 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment =
    @post.comments.create(params[:comment].permit(:commenter, :body))