app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 27 Oct 2013 04:54:06 UTC +00:00], ["text", "I hope this works!"], ["title", "First Rails Post"], ["updated_at", Sun, 27 Oct 2013 04:54:06 UTC +00:00]]

  def show
    @post = Post.find(params[:id]) #use that instance variable in your view!
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 4]]